vidhyamg/UWR-INTERNSHIP/Drivers/src/stm32f401_UsartDriver.c
/*
 * stm32f401_UsartDriver.c
 *
 *  Created on: Sep 9, 2026
 *      Author: deepu
 */


#include "stm32f401.h"
#include "stm32f401_UsartDriver.h"
#include "stm32f401_RccDriver.h"
#include<stdio.h>

/****************************BAUD RATE CALCULATION************************************************
 * @brief calculation formula:
 *               F_CK
Baud = ─────────────────────
       8 × (2 - OVER8) × USARTDIV

Where:
  F_CK = Peripheral clock (APB1 or APB2)
  OVER8 = Oversampling mode (0 = 16x, 1 = 8x)
  USARTDIV = DIV_Mantissa + (DIV_Fraction / 16)

Example: F_CK = 16 MHz, Baud = 115200, OVER8 = 0
  USARTDIV = 16,000,000 / (16 × 115200) = 8.6805

  Mantissa = 8
  Fraction = 0.6805 × 16 = 10.89 ≈ 11 (0xB)

  BRR = (8 << 4) | 11 = 0x8B
 */

void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{

	//Variable to hold the APB clock
	uint32_t PCLKx;

	uint32_t usartdiv;

	//variables to hold Mantissa and Fraction values
	uint32_t M_part,F_part;

  uint32_t tempreg=0;

  //Get the value of APB bus clock in to the variable PCLKx
  if(pUSARTx == USART1 || pUSARTx == USART6)
  {
	   //USART1 and USART6 are hanging on APB2 bus
	   PCLKx = RCC_GetPCLK2Value();
  }else
  {
	   PCLKx = RCC_GetPCLK1Value();
  }

  //Check for OVER8 configuration bit
  if(pUSARTx->CR1 & (1 << USART_CR1_OVER8))
  {
	   //OVER8 = 1 , over sampling by 8
	   usartdiv = ((25 * PCLKx) / (2 *BaudRate));
  }else
  {
	   //over sampling by 16
	   usartdiv = ((25 * PCLKx) / (4 *BaudRate));
  }

  //Calculate the Mantissa part
  M_part = usartdiv/100;

  //Place the Mantissa part in appropriate bit position . refer USART_BRR
  tempreg |= M_part << 4;

  //Extract the fraction part
  F_part = (usartdiv - (M_part * 100));

  //Calculate the final fractional
  if(pUSARTx->CR1 & ( 1 << USART_CR1_OVER8))
   {
	  //OVER8 = 1 , over sampling by 8
	  F_part = ((( F_part * 8)+ 50) / 100)& ((uint8_t)0x07);

   }else
   {
	   //over sampling by 16
	   F_part = ((( F_part * 16)+ 50) / 100) & ((uint8_t)0x0F);

   }

  //Place the fractional part in appropriate bit position .
  tempreg |= F_part;

  //copy the value of tempreg in to BRR register
  pUSARTx->BRR = tempreg;
}



 /*******************USART_Init Function************************************************
  * @brief  Initializes the USARTx peripheral according to the specified parameters
  * @param  pUSARTx: Pointer to the USART register structure
  * @param  USART_InitStruct: Pointer to a USART_InitTypeDef structure that contains
  *         the configuration information for the specified USART peripheral.
  * @retval None
  */


 void USART_Init(USART_Handle_t *pUSARTHandle)
 {

 	//Temporary variable
 	uint32_t tempreg=0;

 /******************************** Configuration of CR1******************************************/

 	//Implement the code to enable the Clock for given USART peripheral
 	 USART_PeriClockControl(pUSARTHandle->pUSARTx,ENABLE);

 	//Enable USART Tx and Rx engines according to the USART_Mode configuration item
 	if ( pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
 	{
 		//Implement the code to enable the Receiver bit field
 		tempreg|= (1 << USART_CR1_RE);
 	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
 	{
 		//Implement the code to enable the Transmitter bit field
 		tempreg |= ( 1 << USART_CR1_TE );

 	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
 	{
 		//Implement the code to enable the both Transmitter and Receiver bit fields
 		tempreg |= ( ( 1 << USART_CR1_RE) | ( 1 << USART_CR1_TE) );
 	}

     //Implement the code to configure the Word length configuration item
 	tempreg |= pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M ;


     //Configuration of parity control bit fields
 	if ( pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
 	{
 		//Implement the code to enable the parity control
 		tempreg |= ( 1 << USART_CR1_PCE);

 		//Implement the code to enable EVEN parity
 		//Not required because by default EVEN parity will be selected once you enable the parity control

 	}else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
 	{
 		//Implement the code to enable the parity control
 	    tempreg |= ( 1 << USART_CR1_PCE);

 	    //Implement the code to enable ODD parity
 	    tempreg |= ( 1 << USART_CR1_PS);

 	}

    //Program the CR1 register
 	pUSARTHandle->pUSARTx->CR1 = tempreg;

 	/******************************** Configuration of CR2******************************************/

 		tempreg=0;

 		//Implement the code to configure the number of stop bits inserted during USART frame transmission
 		tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP;

 		//Program the CR2 register
 		pUSARTHandle->pUSARTx->CR2 = tempreg;

 		/******************************** Configuration of CR3******************************************/

 			tempreg=0;

 			//Configuration of USART hardware flow control
 			if ( pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
 			{
 				//Implement the code to enable CTS flow control
 				tempreg |= ( 1 << USART_CR3_CTSE);


 			}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
 			{
 				//Implement the code to enable RTS flow control
 				tempreg |= ( 1 << USART_CR3_RTSE);

 			}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
 			{
 				//Implement the code to enable both CTS and RTS Flow control
 				tempreg |= ( 1 << USART_CR3_CTSE);
 				tempreg |= ( 1 << USART_CR3_RTSE);
 			}


 			pUSARTHandle->pUSARTx->CR3 = tempreg;

 			/******************************** Configuration of BRR(Baudrate register)******************************************/

 				//Implement the code to configure the baud rate

 				USART_SetBaudRate(pUSARTHandle->pUSARTx,pUSARTHandle->USART_Config.USART_Baud);

 			}

 /*****************USART_ENABLE/DISABLE functions *********************************
  * @brief  Enables or disables the specified USART peripheral
  * @param  pUSARTx: Pointer to the USART register structure
  * @param  EnorDi: ENABLE or DISABLE macros
  * @retval None
  */

 void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t Cmd)
 {
 	if(Cmd == ENABLE)
 	{
 		pUSARTx->CR1 |= (1 << 13);
 	}else
 	{
 		pUSARTx->CR1 &= ~(1 << 13);
 	}

 }

 /*********************** USART_PERI_CLK_CONTROL ***************************************
  * @brief  Enables or disables the peripheral clock for the specified USART peripheral
  * @param  pUSARTx: Pointer to the USART register structure
  * @param  EnorDi: ENABLE or DISABLE macros
  * @retval None
  */


 void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
 {
 	if(EnorDi == ENABLE)
 	{
 		if(pUSARTx == USART1)               // Check if the USART peripheral is USART1
 		{
 			USART1_PCLK_EN();
 		}else if (pUSARTx == USART2)       // Check if the USART peripheral is USART2
 		{
 			USART2_PCLK_EN();
 		}else if (pUSARTx == USART6)       // Check if the USART peripheral is USART6
 		{
 			USART6_PCLK_EN();
 		}
 	}
 	else
 	{
 		if(pUSARTx == USART1)            // Check if the USART peripheral is USART1
 		{
 			USART1_PCLK_DI();
 		}else if (pUSARTx == USART2)    // Check if the USART peripheral is USART2
 		{
 			USART2_PCLK_DI();
 		}else if (pUSARTx == USART6)   // Check if the USART peripheral is USART6
 		{
 			USART6_PCLK_DI();
 		}
 	}
 }


 /*********************** USART_GET_FLAG_STATUS ***************************************
  * @brief  Checks the status of a specific flag in the USART status register
  * @param  pUSARTx: Pointer to the USART register structure
  * @param  StatusFlagName: The specific flag to check (e.g., USART_FLAG_TXE, USART_FLAG_RXNE)
  * @retval Flag status (SET or RESET)
  */
 uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx, uint8_t StatusFlagName)
 {
     if(pUSARTx->SR & StatusFlagName)       // Check if the specified flag is set in the status register(SR_TXE, SR_RXNE, SR_TC)
 	{
     	return SET;
     }

    return RESET;
 }

 /**********************USART_SEND_DATA ***************************************
  * @brief  Sends data through the specified USART peripheral
  * @param  pUSARTx: Pointer to the USART register structure
  * @param  pSrc: Pointer to the source buffer
  * @param  Len: Number of bytes to send
  * @retval None
  */
 void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
 {

 	uint16_t *pdata;

    //Loop over until "Len" number of bytes are transferred
 	for(uint32_t i = 0 ; i < Len; i++)
 	{
 		//Implement the code to wait until TXE flag is set in the SR
 		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_TXE));

 		//Check the USART_WordLength item for 9BIT or 8BIT in a frame
 		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
 		{
 			//if 9BIT load the DR with 2bytes masking  the bits other than first 9 bits
 			pdata = (uint16_t*) pTxBuffer;
 			pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);

 			//check for USART_ParityControl
 			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
 			{
 				//No parity is used in this transfer , so 9bits of user data will be sent
 				//Implement the code to increment pTxBuffer twice
 				pTxBuffer++;
 				pTxBuffer++;
 			}
 			else
 			{
 				//Parity bit is used in this transfer . so 8bits of user data will be sent
 				//The 9th bit will be replaced by parity bit by the hardware
 				pTxBuffer++;
 			}
 		}
 		else
 		{
 			//This is 8bit data transfer
 			pUSARTHandle->pUSARTx->DR = (*pTxBuffer  & (uint8_t)0xFF);

 			//Implement the code to increment the buffer address
 			pTxBuffer++;
 		}
 	}

 	//Implement the code to wait till TC flag is set in the SR
 	while( ! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_TC));
 }

